In [5]:
import pandas as pd

# Task 1

#### Create a DataFrame from a dictionary

In [6]:
# Dictionary
data_dict={
    'Name':['Prem','Hira','Ramesh','Raju'],
    'Address':['Rupandehi','Gulmi','Palpa','Kaski'],
    'Age':[34,45,23,56],
   'Email':['p_rem@gmail.com','hira@xyz.com','rb@gmail.com','raju@gmail.com']
}
df_dict=pd.DataFrame(data_dict)
print(df_dict)

     Name    Address  Age            Email
0    Prem  Rupandehi   34  p_rem@gmail.com
1    Hira      Gulmi   45     hira@xyz.com
2  Ramesh      Palpa   23     rb@gmail.com
3    Raju      Kaski   56   raju@gmail.com

#### Create a DataFrame from a list of dictionaries

In [7]:
# Example list of dictionary
data_lit=[
    {'Name':'Prem','Address':'Rupandehi','Age':34},
    {'Name':'Hira','Address':'Gulmi','Age':45},
    {'Name':'Ramesh','Address':'Palpa','Age':23},
    {'Name':'Ramesh','Address':'Kaski','Age':56}
]
df_list=pd.DataFrame(data_lit)
print(df_list)

     Name    Address  Age
0    Prem  Rupandehi   34
1    Hira      Gulmi   45
2  Ramesh      Palpa   23
3  Ramesh      Kaski   56

####  Load a dataset from a CSV file

In [57]:
# Load the dataset
df = pd.read_csv('messed_dataset.csv')
df_data=pd.DataFrame(df)
#print(df.head())
print(df_data)

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

## Task 2: Viewing and Inspecting Data

##### Display the first and last few rows of the DataFrame.

In [14]:
# print the first few rows
print(df.head())

# print the few last rows
print(df.tail())

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19
                  Name   Age                     Email            Country  \
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

#### Get a summary of the DataFrame, including basic statistics and data types.

In [15]:
# Get summary of the DataFrame
print("Summary of the Dataframe :")
print(df.info())

# Get basic statistics
print("\n Basic statistics of the DataFrame")
print(df.describe())

Summary of the Dataframe :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           89 non-null     object
 1   Age            97 non-null     object
 2   Email          80 non-null     object
 3   Country        86 non-null     object
 4   Salary         94 non-null     object
 5   DateOfJoining  79 non-null     object
dtypes: object(6)
memory usage: 4.8+ KB
None

 Basic statistics of the DataFrame
           Name   Age                Email Country   Salary DateOfJoining
count        89    97                   80      86       94            79
unique       85    53                   80      76       93            79
top     invalid  76.0  ycastro@example.org   China  invalid    2022-09-29
freq          5     6                    1       2        2             1

#### Display the shape and column names of the DataFrame.

In [19]:
# Display the shape of DataFrame
print('Display The Shape of DataFrame')
print(df.shape)

#Display the column name
print('\nDisplay column name of the DataFrame')
print(df.columns)

Display The Shape of DataFrame
(100, 6)

Display name of the DataFrame
Index(['Name', 'Age', 'Email', 'Country', 'Salary', 'DateOfJoining'], dtype='object')

## Task 3: Selection and Indexing

#### Select a single column and multiple columns.

In [23]:
# Select single column
name=df['Name'] 
print("First Name")
print(name)

First Name
0                invalid
1        David Jefferson
2          Jessica Reyes
3      Kenneth Macdonald
4            Julie Horne
             ...
95      Garrett Davidson
96        Elizabeth Ross
97                   NaN
98        Patricia Singh
99    Christopher Stokes
Name: Name, Length: 100, dtype: object
                  Name                     Email    Salary
0              invalid       ycastro@example.org  44694.24
1      David Jefferson                       NaN       NaN
2        Jessica Reyes                       NaN  60511.62
3    Kenneth Macdonald         ewolf@example.com  84223.29
4          Julie Horne                       NaN  24665.13
..                 ...                       ...       ...
95    Garrett Davidson        gjames@example.com  86227.88
96      Elizabeth Ross  richardlewis@example.net  29992.69
97                 NaN       brian50@example.com  90628.22
98      Patricia Singh      lramirez@example.org  85290.44
99  Christopher Stokes                       NaN  20289.17

[100 rows x 3 columns]

In [24]:
#Select Muitiple Columns
two_columns=df[['Name','Email','Salary']]
print(two_columns)

                  Name                     Email    Salary
0              invalid       ycastro@example.org  44694.24
1      David Jefferson                       NaN       NaN
2        Jessica Reyes                       NaN  60511.62
3    Kenneth Macdonald         ewolf@example.com  84223.29
4          Julie Horne                       NaN  24665.13
..                 ...                       ...       ...
95    Garrett Davidson        gjames@example.com  86227.88
96      Elizabeth Ross  richardlewis@example.net  29992.69
97                 NaN       brian50@example.com  90628.22
98      Patricia Singh      lramirez@example.org  85290.44
99  Christopher Stokes                       NaN  20289.17

[100 rows x 3 columns]

#### Select rows by index or lable and specific rows and columns using loc and iloc.

In [25]:
# Select row by index 0 to 3
rows_by_index=df.iloc[0:3]
print(rows_by_index)

              Name   Age                Email      Country    Salary  \
0          invalid  59.0  ycastro@example.org  Switzerland  44694.24
1  David Jefferson  21.0                  NaN        China       NaN
2    Jessica Reyes  34.0                  NaN          NaN  60511.62

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24

In [41]:
# Select rows by id and columns by label
rows_by_label=df.loc[0:2,['Name','Email']]
print("\n Rows by label:")
print(rows_by_label)

 Rows by label:
              Name                Email
0          invalid  ycastro@example.org
1  David Jefferson                  NaN
2    Jessica Reyes                  NaN

## Task 4: Handling Missing Data

#### Identify missing values in the DataFrame.

In [45]:
missing_value=df.isnull().sum()
print(missing_value)

Name             11
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64

#### Drop rows with missing values.

In [61]:
#Drop row with any missiong value
df_drop=df.dropna(inplace=True)
df

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,info@org.com,Ecuador,24665.13,2020-06-19
5,Jonathan Holland,26.0,mayercaitlin@example.org,Cameroon,25660.99,2023-05-01
7,Kimberly Roberts,76.0,lmiller@example.org,Netherlands,58550.56,2023-07-08
9,Jason Perez,59.0,collinsedward@example.com,Myanmar,20175.11,2024-04-11
10,Olivia Strong,76.0,schultzpatricia@example.com,South Africa,72362.02,2023-07-27
12,Kelly Schultz,21.0,info@org.com,Kiribati,93448.73,2023-07-24
13,Jessica Rivera,73.0,fmitchell@example.net,Central African Republic,71261.36,2021-05-18
15,Lauren Becker,30.0,watsonjeffrey@example.net,Malta,invalid,2020-01-13
19,Amy Sims,31.0,info@org.com,Bolivia,51559.83,2023-08-22
20,Dylan Simpson,46.0,jessica74@example.net,Serbia,59670.5,2021-10-31
23,Karen Ward,56.0,daniel47@example.com,Congo,83580.8,2022-04-09
24,Amy Henson,80.0,tylerwatts@example.org,Bosnia and Herzegovina,35390.77,2023-12-11
28,Ricardo Moody,76.0,xmorales@example.net,Bahrain,83514.58,2024-03-29
29,Stephanie Moss,61.0,qvaughan@example.com,Guernsey,35671.38,2021-11-22
33,Laura Pham,69.0,info@org.com,Israel,45046.19,2024-04-01
35,Rebecca Davis,35.0,wallacejennifer@example.net,Sri Lanka,66871.64,2022-08-06
36,Keith Velazquez,22.0,charles82@example.net,Burkina Faso,81661.97,2024-03-27
37,Christopher Martin,40.0,tina11@example.com,Netherlands Antilles,81367.57,2020-07-30
38,Lindsey York,38.0,info@org.com,Mexico,97896.77,2022-03-05
40,invalid,64.0,mjackson@example.org,British Indian Ocean Territory (Chagos Archipe...,25219.6,2024-02-14
43,James Davis,invalid,teresa22@example.com,Mauritius,54801.7,2021-07-15
44,Brandi White,35.0,mhall@example.net,Tanzania,21408.87,2020-11-26
49,Amber Mendoza,64.0,qrobinson@example.com,Uganda,47293.85,2021-05-27
51,Whitney Graham,40.0,zrodriguez@example.org,Mozambique,98826.59,2023-05-08
52,Patrick Brown PhD,44.0,james16@example.net,Greece,83842.6,2020-07-12
58,Dr. Olivia Caldwell MD,76.0,hernandezjason@example.com,Philippines,78453.84,2023-07-19
59,Diane Smith,57.0,david44@example.net,Saint Barthelemy,86579.95,2020-07-27
60,Thomas Navarro,50.0,psnyder@example.org,Turks and Caicos Islands,86286.69,2020-11-03
61,Terri Phillips,27.0,garyanderson@example.net,Cambodia,47755.97,invalid
63,Wesley Whitaker,47.0,info@org.com,British Indian Ocean Territory (Chagos Archipe...,97832.79,2020-12-20
64,Andrew Bryant,43.0,jacobtorres@example.com,Colombia,32205.53,2020-10-26
68,Justin Wright,29.0,elizabethreid@example.org,Timor-Leste,28951.24,2020-02-21
69,Michael Oconnell,19.0,fdelacruz@example.org,Grenada,62929.05,2022-01-21
70,Christina Garcia,40.0,kathryn18@example.org,invalid,73916.51,2023-11-13
72,Morgan Brown,79.0,wsmith@example.org,Cape Verde,28583.22,2021-03-12
73,Mitchell Smith,32.0,spierce@example.com,Armenia,57795.75,2021-04-19
74,Whitney Garcia,70.0,tylergolden@example.com,Netherlands Antilles,68794.39,2022-07-23
78,Tabitha Delgado,74.0,lancewilliams@example.net,Sudan,98396.21,2022-04-03
80,David Walker,43.0,linda84@example.net,Guinea-Bissau,89683.17,2021-06-20
81,Brandi Long,45.0,vford@example.com,Ecuador,30773.53,2020-06-29
82,Kristi Calderon,80.0,sharon04@example.com,Iceland,99507.66,2022-07-09
83,Kendra Mason,47.0,megancarter@example.com,Moldova,34369.87,2023-07-09
84,Debbie Romero,58.0,nathaniel61@example.net,Reunion,39875.14,2023-02-11
85,Elizabeth Wilkinson,66.0,gailmcdonald@example.org,Turkmenistan,69624.01,2023-05-19
86,David Randall,74.0,cody30@example.net,Niue,43013.14,2024-05-24
87,Nancy Irwin,42.0,juliaweaver@example.net,Czech Republic,29455.0,2020-07-21
88,Joel Martin,76.0,bjacobson@example.com,Korea,invalid,2022-05-23
89,Lauren Jones,68.0,melissadyer@example.com,Malawi,42435.96,2020-06-12
90,invalid,43.0,info@org.com,Indonesia,41928.2,2020-05-08
91,Ryan Middleton,42.0,mcconnellashley@example.net,Bahamas,78048.75,2021-04-05
92,Seth Bradley,76.0,melissakim@example.org,Slovakia (Slovak Republic),49354.13,2021-08-01
93,Alicia Miller,59.0,thomas45@example.net,Mauritania,52834.29,2020-06-03
94,Cody Jackson,48.0,jamieayers@example.net,Luxembourg,55583.62,2021-05-23
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,info@org.com,South Africa,20289.17,2021-09-23

#### Fill missing values with a specified value.

In [60]:
# Fill missing value with specified value
#check 
df.fillna(value={'Email':'info@org.com'},inplace=True)
df

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,info@org.com,China,NaN,2021-10-04
2,Jessica Reyes,34.0,info@org.com,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,info@org.com,Ecuador,24665.13,2020-06-19
...,...,...,...,...,...,...
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,info@org.com,South Africa,20289.17,2021-09-23

## Task 5: Data Operations

In [62]:
# Add a new column to the DataFrame.
#woring with data_dict
df_dict

     Name    Address  Age            Email
0    Prem  Rupandehi   34  p_rem@gmail.com
1    Hira      Gulmi   45     hira@xyz.com
2  Ramesh      Palpa   23     rb@gmail.com
3    Raju      Kaski   56   raju@gmail.com

In [64]:
df_dict['phone']=[980000,9788000,890090,990000]
df_dict

     Name    Address  Age            Email    phone
0    Prem  Rupandehi   34  p_rem@gmail.com   980000
1    Hira      Gulmi   45     hira@xyz.com  9788000
2  Ramesh      Palpa   23     rb@gmail.com   890090
3    Raju      Kaski   56   raju@gmail.com   990000

In [65]:
# Deleting Email Columns 
df_dict.drop(columns=['Email'],inplace=True)
df_dict

     Name    Address  Age    phone
0    Prem  Rupandehi   34   980000
1    Hira      Gulmi   45  9788000
2  Ramesh      Palpa   23   890090
3    Raju      Kaski   56   990000

In [67]:
df_dict.rename(columns={'phone':'Phone'},inplace=True)
df_dict

     Name    Address  Age    Phone
0    Prem  Rupandehi   34   980000
1    Hira      Gulmi   45  9788000
2  Ramesh      Palpa   23   890090
3    Raju      Kaski   56   990000

In [69]:
df_dict['Age']=df_dict['Age'].apply(lambda x:x+5)
df_dict

     Name    Address  Age    Phone
0    Prem  Rupandehi   44   980000
1    Hira      Gulmi   55  9788000
2  Ramesh      Palpa   33   890090
3    Raju      Kaski   66   990000

## Task 6: GroupBy Operations

In [83]:
grouped=df_dict.groupby('Name')
grouped

In [84]:
mean_score=grouped['Age'].mean()
mean_score

Name
Hira      55.0
Prem      44.0
Raju      66.0
Ramesh    33.0
Name: Age, dtype: float64

## Task 7: Merging and Joining DataFrames

In [86]:
df1=pd.DataFrame({
    'Palpa_dep':['Rita Karki',32,'Kaski'],
    'Butwal_dep':['Hira',21,'Palpa']},
    index=['BM Name','Age','Address'])
df1

          Palpa_dep Butwal_dep
BM Name  Rita Karki       Hira
Age              32         21
Address       Kaski      Palpa

In [87]:
df2=pd.DataFrame({
    'Gulmi_dep':['Kamal Karki',31,'Rupandehi'],
    'Dang_dep':['Lalit',26,'Palpa']},
    index=['BM Name','Age','Address'])
df2

           Gulmi_dep Dang_dep
BM Name  Kamal Karki    Lalit
Age               31       26
Address    Rupandehi    Palpa

In [88]:
join_df=df1.join(df2)
join_df

          Palpa_dep Butwal_dep    Gulmi_dep Dang_dep
BM Name  Rita Karki       Hira  Kamal Karki    Lalit
Age              32         21           31       26
Address       Kaski      Palpa    Rupandehi    Palpa

## Task 8: Working with Dates and Times

In [94]:
df_dict['Date']=pd.date_range(start='2/2/2024',periods=len(df_dict),freq='d')
df_dict

     Name    Address  Age    Phone       Date
0    Prem  Rupandehi   44   980000 2024-02-02
1    Hira      Gulmi   55  9788000 2024-02-03
2  Ramesh      Palpa   33   890090 2024-02-04
3    Raju      Kaski   66   990000 2024-02-05

In [101]:
df_dict['Year']=df_dict['Date'].dt.year
df_dict['Month']=df_dict['Date'].dt.month
df_dict['Day']=df_dict['Date'].dt.day
df_dict

     Name    Address  Age    Phone       Date  Month  Day  Year
0    Prem  Rupandehi   44   980000 2024-02-02      2    2  2024
1    Hira      Gulmi   55  9788000 2024-02-03      2    3  2024
2  Ramesh      Palpa   33   890090 2024-02-04      2    4  2024
3    Raju      Kaski   66   990000 2024-02-05      2    5  2024

## Task 9: Input and Output

In [115]:
df_csv=pd.read_csv('messed_dataset.csv')
data_csv=pd.DataFrame(df_csv)
data_csv.dropna(inplace=True)
data_csv.to_csv('new_data.csv',index=False)

In [125]:
df_ex=pd.read_excel('SaleData.xlsx',sheet_name='SaleData')
df_data=pd.DataFrame(df_ex)
df_data.to_excel('new_output.xlsx',sheet_name='trading_data',index=False)

# Task 3
- Data Analysis. Analyse the data by giving the summary statistics, and more information about the data

In [ ]:
import matplotlib.pyplot as plt

# Data Visualization
- Visualize the data by using the visualization libraries

In [ ]:
# Your code goes here